let now = new Date(); // Створюємо новий об'єкт Date для поточної дати та часу.    
let shedevt = {
    tbegin: new Date(now.getTime()+ 5000), // Дата/час початку події - встановлюється через 5 секунд після поточного часу.
    tend: new Date (now.getTime() + 10000), // Дата/час кінця події - встановлюється через 10 секунд після поточного часу.
    topic: "lamp", // Адресат для події.
    cmdbegin:"on", // Команда на виконання для початку події.
    cmdend:"off" // Команда на виконання для кінця події.
};

let fnshed = function () { // Оголошуємо функцію fnshed без параметрів.
    let dt = new Date(); // Створюємо новий об'єкт Date для поточної дати та часу.
    msgtxt = dt.toLocaleString(); // Генеруємо рядок, що представляє поточну дату та час у локальному форматі.
    let msg = {}; // Створюємо об'єкт для зберігання повідомлення.

    // Перевіряємо, чи поточний час більший або рівний кінцевому часу події.
    if (dt.getTime()>=shedevt.tend.getTime()) {
        clearTimeout(htmr); // Якщо умова виконується, очищаємо таймер htmr.
        msgtxt = msg.msgtxt + ": Подію зупинено"; // Додаємо повідомлення про зупинку події до рядка msgtxt.
        shedevt.started = false; // Встановлюємо прапорець, що подія зараз не працює.
        msg.payload = shedevt.cmdend; // Додаємо команду на виконання для кінця події до об'єкта повідомлення.
        msg.topic = shedevt.topic; // Додаємо адресат для події до об'єкта повідомлення.
        console.log (msg); // Виводимо повідомлення у консоль.
    }    
    // Перевіряємо, чи поточний час більший або рівний початковому часу події, і чи подія ще не почалася.
    else if ((dt.getTime()>=shedevt.tbegin.getTime()) && (!shedevt.started)) {
        msgtxt = msg.msgtxt + ": Подію запущено"; // Додаємо повідомлення про запуск події до рядка msgtxt.
        msg.payload = shedevt.cmdbegin; // Додаємо команду на виконання для початку події до об'єкта повідомлення.
        msg.topic = shedevt.topic; // Додаємо адресат для події до об'єкта повідомлення.
        shedevt.started = true; // Встановлюємо прапорець, що подія зараз працює.
        console.log (msg); // Виводимо повідомлення у консоль.
    }
    console.log (msgtxt); // Виводимо рядок msgtxt у консоль.
}    
htmr = setInterval(fnshed, 1000); // Встановлюємо інтервал виклику функції fnshed кожну секунду.
console.log (now.toLocaleString () + " Планувальник запущено"); // Виводимо поточну дату та час у локальному форматі разом з повідомленням "Планувальник запущено" у консоль.
